# GetDefaultFloorType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Floor..::..GetDefaultFloorType Method
Floor Class See Also
---
Returns id of default floor type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static ElementId GetDefaultFloorType(
	Document document,
	bool isFoundation
)
```

Visual Basic
---
```text
Public Shared Function GetDefaultFloorType ( _
	document As Document, _
	isFoundation As Boolean _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetDefaultFloorType(
	Document^ document,
	bool isFoundation
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
isFoundation
    Type: System..::..Boolean True to return id of foundation floor type.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Floor Class
Autodesk.Revit.DB Namespace